Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: Microsoft SQL Server functions
es: Funciones de Microsoft SQL Server

source: In the second variant, min() returns the lowest value in numbers.
es: Si el primer parámetro es un array, min() devuelve el menor valor en ese array.

source: If none of the values is a float, all of them will be treated as integer s, and an integer is returned.
es: Si el primer parámetro es un entero, string o double, necesita al menos dos parámetros y min() devuelve el número menor de estos valores.

source: Upon failure, min() returns NULL and an error of level E_WARNING is generated.
es: Puede comparar un número ilimitado de valores.

source: See also max().
es: Si ninguno de los valores es un double, todos ellos serán tratados como enteros, y se devolverá un entero.

source: Note that you probably want to specify the mode as an octal number, which means it should have a leading zero.
es: Trata de crear el directorio especificado por pathname.

source: mkdir ("/ path / to / my / dir", 0700);
es: Devuelve TRUE en caso de éxito y FALSE en caso de fallo.

source: See also rmdir().
es: Ver también rmdir().

source: It is a common error to mix these values up in a script.
es: Véase el extraño orden de los argumentos, que se diferencia del orden de argumentos en una llamada mktime() de UNIX y que no permite eliminar parámetros de derecha a izquierda (ver abajo).

source: Returns the Unix timestamp corresponding to the arguments given.
es: Es un error común mezclar estos valores en un script.

source: This timestamp is a long integer containing the number of seconds between the Unix Epoch (January 1 1970) and the time specified.
es: Devuelve el valor timestamp Unix correspondiente a los argumentos dados.

source: Arguments may be left out in order from right to left; any arguments thus omitted will be set to the current value according to the local date and time.
es: El timestamp es un entero de tipo long que contiene el número de segundos entre el valor Unix Epoch (1 de enero de 1970) y la hora especificada.

source: is_dst can be set to 1 if the time is during daylight savings time, 0 if it is not, or -1 (the default) if it is unknown whether the time is within daylight savings time or not.
es: Se pueden eliminar argumentos en orden de derecha a izquierda; en los argumentos omitidos se toma el valor de la fecha y hora locales.

source: This can cause unexpected (but not incorrect) results.
es: is_dst puede ponerse a 1 si la hora corresponde a horario de verano, 0 si no, o -1 (valor por omisión) si no se sabe.

source: mktime() is useful for doing date arithmetic and validation, as it will automatically calculate the correct value for out-of-range input.
es: mktime() es útil para realizar cálculos y validaciones con fechas, ya que calcula automáticamente el valor correcto para una entrada fuera de rango.

source: For example, each of the following lines produces the string "Jan-01-1998".
es: Por ejemplo, cada una de las líneas siguientes produce la cadena "Jan-01-1998".

source: Example 1. mktime() example
es: Ejemplo 1.

source: echo date ("M-d-Y", mktime (0,0,0,12,32,1997)); echo date ("M-d-Y", mktime (0,0,0,13,1,1997)); echo date ("M-d-Y", mktime (0,0,0,1,1,1998)); echo date ("M-d-Y", mktime (0,0,0,1,1,98));
es: echo date( "M-d-Y", mktime(0,0,0,12,32,1997)); echo date ("M-d-Y", mktime(0,0,0,13,1,1997)); echo date ("M-d-Y", mktime(0,0,0,1,1,1998));

source: The last day of any given month can be expressed as the "0" day of the next month, not the -1 day.
es: El último día de cada mes se puede expresar como el día "0" del mes siguiente, no el día -1.

source: Both of the following examples will produce the string "The last day in Feb 2000 is:
es: Los dos ejemplos siguientes producen la cadena "The last day in Feb 2000 is:

source: Last day of next month
es: El último día del próximo mes

source: Date with year, month and day equal to zero is considered illegal (otherwise it what be regarded as 30.11.1999, which would be strange behavior).
es: $lastday=mktime( 0,0,0,3,0,2000); echo strftime("Last day in Feb 2000 is: %d",$lastday); $lastday=mktime(0,0,0,4,-31,2000); echo strftime("Last day in Feb 2000 is: %d",$lastday);

source: See also date() and time().
es: Ver también date() y time().

source: Example 1. money_format() Example
es: Ejemplo 1. money_format() Example

source: Returns number of affected ("touched") rows by a specific query (i.e. the number of rows returned by a SELECT, the number of rows modified by an update, or the number of rows removed by a delete).
es: Devuelve el número de filas involucradas ("tocadas") por una consulta específica (i.e. el número de filas devueltas por una SELECT, el número de filas modificadas por una actualización (update), o el número de filas suprimidas por una eliminación (delete)).

source: See also: msql_query().
es: Véase también: msql_query()

source: mSQL functions
es: funciones mSQL

source: Returns TRUE on success, FALSE on error.
es: Devuelve TRUE si tiene éxito, FALSE en caso de error.

source: msql_close() closes the link to a mSQL database that's associated with the specified link identifier.
es: msql_close() cierra la conexión con una base de datos mSQL que está asociada con el identificador de conexión (link identifier) especificado.

source: msql_close() will not close persistent links generated by msql_pconnect().
es: msql_close() no cerrará las conexiones permanentes creadas por msql_pconnect().

source: See also: msql_connect() and msql_pconnect().
es: Véase también: msql_connect() y msql_pconnect().

source: Returns a positive mSQL link identifier on success, or FALSE on error.
es: Devuelve un identificador de conexión mSQL positivo si tiene éxito, o FALSE en caso de error.

source: msql_connect() establishes a connection to a mSQL server.
es: msql_connect() establece una conexión con un servidor mSQL.

source: It defaults to 'localhost'.
es: El argumento hostname es opcional, y en caso de que falte, se asume localhost.

source: In case a second call is made to msql_connect() with the same arguments, no new link will be established, but instead, the link identifier of the already opened link will be returned.
es: En caso de que se haga una segunda llamada a msql_connect() con los mismos argumentos, no se establece una nueva conexión, en lugar de eso, se devuelve el identificador de conexión ya abierto.

source: The link to the server will be closed as soon as the execution of the script ends, unless it' s closed earlier by explicitly calling msql_close().
es: La conexión con el servidor se cerrará tan pronto como la ejecución del script finalice, a menos que sea cerrada antes explícitamente por una llamada a msql_close().

source: See also msql_pconnect(), msql_close().
es: Véase también: msql_pconnect(), msql_close().

source: msql_create_db() attempts to create a new database on the server associated with the specified link identifier.
es: msql_create_db() intenta crear una base de datos nueva en el servidor asociado con el identificador de conexión (link identifier) especificado.

source: See also: msql_drop_db().
es: Véase también: msql_drop_db().

source: Identical to msql_create_db().
es: Idéntica a msql_create_db().

source: msql_data_seek() moves the internal row pointer of the mSQL result associated with the specified query identifier to point to the specifyed row number.
es: msql_data_seek() desplaza el puntero interno de fila del resultado mSQL asociado con el identificador de consulta (query identifier) especificado para que apunte al número de fila (row number) proporcionado.

source: The next call to msql_fetch_row() would return that row.
es: La llamada posterior a msql_fetch_row() devolverá esa fila.

source: See also: msql_fetch_row().
es: Véase también: msql_fetch_row().

source: msql_dbname() returns the database name stored in position i of the result pointer returned from the msql_listdbs() function.
es: msql_dbname() devuelve el nombre de base de datos almacenado en la posición i del puntero devuelto desde la función msql_listdbs().

source: The msql_numrows() function can be used to determine how many database names are available.
es: La función msql_numrows() puede utilizarse para determinar cuantos nombres de base de datos hay disponibles.

source: msql_drop_db() attempts to drop (remove) an entire database from the server associated with the specified link identifier.
es: msql_drop_db() intenta eliminar (suprimir) una base de datos completa del servidor asociado con el identificador de conexión (link identifier) especificado.

source: See also: msql_create_db().
es: Véase también: msql_create_db().

source: See msql_drop_db().
es: Véase msql_drop_db().

source: Errors coming back from the mSQL database backend no longer issue warnings.
es: Los errores que devuelve el servidor de base de datos mSQL no dan mucha información sobre el problema.

source: Instead, use these functions to retrieve the error string.
es: Por este motivo, utilice estas funciones para recuperar la cadena de carácteres del error.

source: Returns an array that corresponds to the fetched row, or FALSE if there are no more rows.
es: Devuelve un array que se corresponde con la fila recuperada, o FALSE si no hay más filas.

source: msql_fetch_array() is an extended version of msql_fetch_row().
es: msql_fetch_array() es una versión ampliada de msql_fetch_row().

source: In addition to storing the data in the numeric indices of the result array, it also stores the data in associative indices, using the field names as keys.
es: Además de almacenar los datos en los índices numéricos del array resultado, también almacena los datos en índices asociativos, utilizando los nombres de los campos como claves.

source: The second optional argument result_type in msql_fetch_array() is a constant and can take the following values:
es: El segundo argumento opcional result_type en msql_fetch_array() es una constante y puede tomar los valores siguientes:

source: MSQL_ASSOC, MSQL_NUM, and MSQL_BOTH.
es: MSQL_ASSOC, MSQL_NUM, y MYSQL_BOTH.

source: Be careful if you are retrieving results from a query that may return a record that contains only one field that has a value of 0 (or an empty string, or NULL).
es: Sea precavido si está recuperando resultados de una consulta que puede devolver un registro que contiene un único campo que tiene un valor de 0 (o una cadena de carácteres vacía, o NULL).

source: An important thing to note is that using msql_fetch_array() is NOT significantly slower than using msql_fetch_row(), while it provides a significant added value.
es: Un aspecto importante a tener en cuenta es que el uso de msql_fetch_array() NO es significativamente más lento que el uso de msql_fetch_row(), mientras que proporciona un valor añadido significativo.

source: For further details, also see msql_fetch_row().
es: Para detalles adicionales, véase también msql_fetch_row()

source: Returns an object containing field information
es: Devuelve un objeto que contiene la información del campo

source: msql_fetch_field() can be used in order to obtain information about fields in a certain query result.
es: msql_fetch_field() puede utilizarse para obtener información sobre campos del resultado de una consulta.

source: If the field offset isn' t specified, the next field that wasn't yet retreived by msql_fetch_field() is retreived.
es: Si no se especifica el desplazamiento del campo, se recupera el campo siguiente que no haya sido aún recuperado por msql_fetch_field().

source: The properties of the object are:
es: Las propiedades del objeto son:

source: name - column name
es: name - nombre de la columna

source: table - name of the table the column belongs to
es: table - nombre de la tabla a la que pertenece la columna

source: not_null - 1 if the column cannot be NULL
es: not_null - 1 si la columna no puede ser nula

source: primary_key - 1 if the column is a primary key
es: primary_key - 1 si la columna es una clave primaria

source: unique - 1 if the column is a unique key
es: unique - 1 si la columna es una clave única

source: type - the type of the column
es: type - tipo de la columna

source: See also msql_field_seek().
es: Véase también msql_field_seek().

source: Returns an object with properties that correspond to the fetched row, or FALSE if there are no more rows.
es: Devuelve un objeto con las propiedades que corresponden a la fila recuperada, o FALSE si no hay más filas.

source: msql_fetch_object() is similar to msql_fetch_array(), with one difference - an object is returned, instead of an array.
es: msql_fetch_object() es similar a msql_fetch_array(), con una diferencia - se devuelve un objeto en vez de un array.

source: Indirectly, that means that you can only access the data by the field names, and not by their offsets (numbers are illegal property names).
es: Indirectamente esto significa que sólo tiene acceso a los datos por los nombres de los campos, y no por sus desplazamientos (los números son nombres de propiedad no válidos).

source: The optional second argument result_type in msql_fetch_array() is a constant and can take the following values:
es: El segundo parámetro opcional result_type en msql_fetch_array() es una constante y puede tomar los valores siguientes:

source: Speed-wise, the function is identical to msql_fetch_array(), and almost as quick as msql_fetch_row() (the difference is insignificant).
es: Resumiendo, la función es indéntica a msql_fetch_array(), y casi tan rápida como msql_fetch_row() (la diferencia es insignificante).

source: See also: msql_fetch_array() and msql_fetch_row().
es: Véase también: msql_fetch_array() y msql_fetch_row().

source: msql_fetch_row() fetches one row of data from the result associated with the specified query identifier.
es: msql_fetch_row() recupera una fila de datos del resultado asociado con el identificador de consulta (query identifier) especificado.

source: Each result column is stored in an array offset, starting at offset 0.
es: Cada columna devuelta se almacena en un desplazamiento del array, comenzando en el desplazamiento 0.

source: Subsequent call to msql_fetch_row() would return the next row in the result set, or FALSE if there are no more rows.
es: Una llamada posterior a msql_fetch_row() devería devolver la fila siguiente del conjunto resultado, o FALSE si no hay más filas.

source: See also: msql_fetch_array(), msql_fetch_object(), msql_data_seek(), and msql_result().
es: Véase también: msql_fetch_array(), msql_fetch_object(), msql_data_seek(), y msql_result().

source: msql_fieldflags() returns the field flags of the specified field.
es: msql_fieldflags() obtiene los flags del campo (field) especificado.

source: Currently this is either, "not NULL", "primary key", a combination of the two or "" (an empty string).
es: Actualmente pueden ser, "not NULL", "primary key", una combinación de ambos, o "" (cadena vacía).

source: msql_fieldlen() returns the length of the specified field.
es: msql_fieldlen() devuelve la longitud del campo especificado.

source: msql_fieldname() returns the name of the specified field. query_identifier is the query identifier, and field is the field index. msql_fieldname($result, 2); will return the name of the second field in the result associated with the result identifier.
es: msql_fieldname() devuelve el nombre del campo especificado. query_identifier es el identificador de consulta, y field es el índice del campo. msql_fieldname($result, 2); devolverá el nombre del segundo campo del resultado asociado con el identificador result.

source: Seeks to the specified field offset.
es: Se posiciona en el desplazamiento de campo (field offset) especificado.

source: If the next call to msql_fetch_field() won't include a field offset, this field would be returned.
es: Si la siguiente llamada a msql_fetch_field() no incluye un desplazamiento de campo, este campo será el que se devuelva.

source: See also: msql_fetch_field().
es: Véase también: msql_fetch_field().

source: Returns the name of the table field was fetched from.
es: Devuelve el nombre de la tabla desde la que se ha recuperado el campo (field)

source: msql_fieldtype() is similar to the msql_fieldname() function.
es: msql_fieldtype() es similar a la función msql_fieldname().

source: The arguments are identical, but the field type is returned.
es: Los argumentos son idénticos, pero se devuelve el tipo del campo.

source: This will be one of "int", "char" or "real ".
es: Este será "int", "char" o "real ".

source: msql_free_result() frees the memory associated with query_identifier.
es: msql_free_result() libera la memoria asociada con query_identifier.

source: When PHP completes a request, this memory is freed automatically, so you only need to call this function when you want to make sure you don 't use too much memory while the script is running.
es: Cuando PHP completa una petición, esta memoria es liberada automáticamente, por este motivo solo es necesario llamar a esta función cuando se desea estar seguro de que no se utiliza demasiada memoria mientras se está ejecutando el script.

source: See msql_free_result()
es: Véase msql_free_result()

source: Returns a positive mSQL query identifier to the query result, or FALSE on error.
es: Devuelve un identificador de consulta mSQL positivo en el resultado de la consulta, o FALSE en caso de error.

source: msql() selects a database and executes a query on it.
es: msql() selecciona una base de datos y ejecuta una consulta en ella.

source: If the optional link identifier isn' t specified, the function will try to find an open link to the mSQL server and if no such link is found it'll try to create one as if msql_connect() was called with no arguments (see msql_connect()).
es: Si no se especifica el identificador de conexión (link identifier), la función intentará encontrar una conexión abierta en el servidor mSQL y en el caso de que no se encontrase intentará crear uno como si se llamase a msql_connect() sin parámetros (véase msql_connect()).

source: MySQL Functions
es: Funciones MySQL

source: msql_list_dbs() will return a result pointer containing the databases available from the current msql daemon.
es: msql_list_dbs() devolverá un puntero al resultado que contiene las bases de datos disponibles desde el daemon msql en uso.

source: Use the msql_dbname() function to traverse this result pointer.
es: Utilice la función msql_dbname() para recorrer este puntero.

source: See msql_list_dbs().
es: Véase msql_list_dbs().

source: msql_list_fields() retrieves information about the given tablename.
es: msql_list_fields() recupera información sobre el nombre de tabla (tablename) dado.

source: Arguments are the database name and the table name.
es: Los argumentos son el nombre de la base de datos (database name) y el nombre de la tabla (table name).

source: A result pointer is returned which can be used with msql_fieldflags(), msql_fieldlen(), msql_fieldname(), and msql_fieldtype().
es: Se devuelve un puntero al resultado que puede utilizarse con msql_fieldflags(), msql_fieldlen(), msql_fieldname(), y msql_fieldtype().

source: A query identifier is a positive integer.
es: Un indetificador de consulta (query identifier) es un entero positivo.

source: The function returns -1 if a error occurs.
es: La función devuelve -1 si ocurre un error.

source: A string describing the error will be placed in $phperrmsg, and unless the function was called as @msql_list_fields() then this error string will also be printed out.
es: En $phperrmsg se almacena una cadena de carácteres describiendo el error, y a menos que la función sea llamada como @msql_list_fields() esta cadena de error puede ser impresa.

source: See also msql_error().
es: Véase también msql_error().

source: See msql_list_fields().
es: Véase msql_list_fields().

source: The msql_tablename() function should be used to extract the actual table names from the result pointer.
es: msql_list_tables() toma un nombre de base de datos y devuelve un puntero similar al de la función msql() La función msql_tablename() debería utilizarse para obtener los nombres reales de las tablas del puntero devuelto.

source: See msql_list_tables().
es: Véase msql_list_tables().

source: msql_num_fields() returns the number of fields in a result set.
es: msql_num_fields() devuelve el número de campos de un conjunto resultado.

source: See also: msql(), msql_query(), msql_fetch_field(), and msql_num_rows().
es: Véase también: msql(), msql_query(), msql_fetch_field(), y msql_num_rows().

source: Identical to msql_num_fields().
es: Idéntica a msql_num_fields().

source: msql_num_rows() returns the number of rows in a result set.
es: msql_num_rows() devuelve el número de filas de un conjunto resultado.

source: See also: msql(), msql_query(), and msql_fetch_row().
es: Véase también: msql(), msql_query(), y msql_fetch_row().

source: Identical to msql_num_rows().
es: Idéntica a msql_num_rows().

source: Returns a positive mSQL persistent link identifier on success, or FALSE on error.
es: En caso de éxito devuelve un identificador de conexión mSQL persistente positivo, o FALSE en caso de error.

source: msql_pconnect() acts very much like msql_connect() with two major differences.
es: msql_pconnect() se comporta de forma similar a msql_connect() con dos diferencias importantes.

source: First, when connecting, the function would first try to find a (persistent) link that's already open with the same host.
es: Primero, cuando se conecta, la función debe intentar primero localizar una conexión (persistente) que ya esté abierta en el mismo host.

source: Instead, the link will remain open for future use (msql_close() will not close links established by msql_pconnect()).
es: Al contrario, la conexión permanecerá abierta para un uso futuro (msql_close() no cerrará las conexiones abiertas por msql_pconnect()).

source: Returns a positive mSQL query identifier on success, or FALSE on error.
es: Si no se especifica el identificador de conexión, se asume la última conexión abierta.

source: ?php $link = msql_connect( "dbserver") or die("unable to connect to msql server: ".msql_error()); msql_select_db("db", $link) or die("unable to select database'db': ".msql_error()); $result = msql_query("SELECT * FROM table WHERE id=1", $link); if (!$result) {die("query failed: ".msql_error());} while ($row = msql_fetch_array($result)) {echo $row["id"];}?
es: En caso de éxito devuelve un identificador de consulta mSQL positivo, o FALSE en caso de error.

source: See also: msql(), msql_select_db(), and msql_connect().
es: Véase también: msql(), msql_select_db(), y msql_connect().

source: See sql_regcase().
es: Véase sql_regcase().

source: Returns the contents of the cell at the row and offset in the specified mSQL result set.
es: Devuelve el contenido de la celda en la fila y desplazamiento del conjunto resultado mSQL especificado.

source: msql_result() returns the contents of one cell from a mSQL result set.
es: msql_result() devuelve el contenido de una celda de un conjunto resultado mSQL.

source: The field argument can be the field' s offset, or the field's name, or the field's table dot field's name (fieldname.tablename).
es: El argumento campo (field) puede ser el desplazamiento del campo, el nombre del campo, o el nombre de la tabla punto nombre del campo (nombretabla.nombrecampo).

source: If the column name has been aliased ('select foo as bar from.. .'), use the alias instead of the column name.
es: Si el nombre de la columna tiene un alias ('select foo as bar from.. .'), utilice el alias en vez del nombre de la columna.
